---
kind: method
id: M:Autodesk.Revit.DB.FillPattern.IsEqual(Autodesk.Revit.DB.FillPattern)
source: html/6664e193-7745-d06c-1183-37a07824f083.htm
---
# Autodesk.Revit.DB.FillPattern.IsEqual Method

Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern.

## Syntax (C#)
```csharp
public bool IsEqual(
	FillPattern other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.FillPattern`) - The fill pattern to be compared.

## Returns
True for equal, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null